adafruit/seesaw/lib/samd21/samd21c/edc/ATSAMD21J15B.PIC
      <edc:SFRDef edc:access="--nnnnnn" edc:addr="0x410051E0" edc:cname="PCFG7" edc:impl="0x3F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="PTOKEN" edc:desc="Pipe Token" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="BK" edc:desc="Pipe Bank" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTYPE" edc:desc="Pipe Type" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0x41005163" edc:cname="BINTERVAL3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="BITINTERVAL" edc:desc="Bit Interval" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0x410051E3" edc:cname="BINTERVAL7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="BITINTERVAL" edc:desc="Bit Interval" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="ww-w-w-w" edc:addr="0x41005164" edc:cname="PSTATUSCLR3" edc:impl="0xD5" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGL" edc:desc="Data Toggle clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:desc="Curren Bank clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PFREEZE" edc:desc="Pipe Freeze Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:desc="Bank 0 Ready Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:desc="Bank 1 Ready Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="ww-w-w-w" edc:addr="0x410051E4" edc:cname="PSTATUSCLR7" edc:impl="0xD5" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGL" edc:desc="Data Toggle clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:desc="Curren Bank clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PFREEZE" edc:desc="Pipe Freeze Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:desc="Bank 0 Ready Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:desc="Bank 1 Ready Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="ww-w-w-w" edc:addr="0x41005165" edc:cname="PSTATUSSET3" edc:impl="0xD5" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGL" edc:desc="Data Toggle Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:desc="Current Bank Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PFREEZE" edc:desc="Pipe Freeze Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:desc="Bank 0 Ready Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:desc="Bank 1 Ready Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="ww-w-w-w" edc:addr="0x410051E5" edc:cname="PSTATUSSET7" edc:impl="0xD5" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGL" edc:desc="Data Toggle Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:desc="Current Bank Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PFREEZE" edc:desc="Pipe Freeze Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:desc="Bank 0 Ready Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:desc="Bank 1 Ready Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rr-r-r-r" edc:addr="0x41005166" edc:cname="PSTATUS3" edc:impl="0xD5" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGL" edc:desc="Data Toggle" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:desc="Current Bank" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PFREEZE" edc:desc="Pipe Freeze" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:desc="Bank 0 ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:desc="Bank 1 ready" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rr-r-r-r" edc:addr="0x410051E6" edc:cname="PSTATUS7" edc:impl="0xD5" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGL" edc:desc="Data Toggle" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:desc="Current Bank" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PFREEZE" edc:desc="Pipe Freeze" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:desc="Bank 0 ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:desc="Bank 1 ready" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--nnnnnn" edc:addr="0x41005167" edc:cname="PINTFLAG3" edc:impl="0x3F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="TRCPT0" edc:desc="Transfer Complete 0 Interrupt Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRCPT1" edc:desc="Transfer Complete 1 Interrupt Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRFAIL" edc:desc="Error Flow Interrupt Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERR" edc:desc="Pipe Error Interrupt Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXSTP" edc:desc="Transmit  Setup Interrupt Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALL" edc:desc="Stall Interrupt Flag" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--nnnnnn" edc:addr="0x410051E7" edc:cname="PINTFLAG7" edc:impl="0x3F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="TRCPT0" edc:desc="Transfer Complete 0 Interrupt Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRCPT1" edc:desc="Transfer Complete 1 Interrupt Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRFAIL" edc:desc="Error Flow Interrupt Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERR" edc:desc="Pipe Error Interrupt Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXSTP" edc:desc="Transmit  Setup Interrupt Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALL" edc:desc="Stall Interrupt Flag" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--nnnnnn" edc:addr="0x41005168" edc:cname="PINTENCLR3" edc:impl="0x3F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="TRCPT0" edc:desc="Transfer Complete 0 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRCPT1" edc:desc="Transfer Complete 1 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRFAIL" edc:desc="Error Flow Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERR" edc:desc="Pipe Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXSTP" edc:desc="Transmit  Setup Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALL" edc:desc="Stall Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
